; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	spectrograph2 - mode
	spectrograph3 - mode
	infrared0 - mode
	thermograph1 - mode
	Star1 - direction
	GroundStation0 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star13)
	(supports instrument5 infrared0)
	(supports instrument5 spectrograph2)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
)
(:goal (and
	(pointing satellite1 Phenomenon7)
	(have_image Star6 spectrograph2)
	(have_image Phenomenon7 spectrograph2)
	(have_image Star8 thermograph1)
	(have_image Phenomenon9 spectrograph2)
	(have_image Star10 spectrograph2)
	(have_image Star11 thermograph1)
	(have_image Phenomenon12 spectrograph3)
	(have_image Star13 spectrograph2)
	(have_image Phenomenon14 spectrograph2)
	(have_image Phenomenon15 spectrograph2)
	(have_image Planet16 thermograph1)
))

)

; plan
1. (turn_to satellite2 groundstation5 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 groundstation5)
   goals met: 0 of 12
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 12
3. (calibrate satellite2 instrument5 groundstation5)
   added: (calibrated instrument5)
   goals met: 0 of 12
4. (turn_to satellite2 phenomenon15 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 phenomenon15)
   goals met: 0 of 12
5. (take_image satellite2 phenomenon15 instrument5 spectrograph2)
   added: (have_image phenomenon15 spectrograph2)
   goals met: 1 of 12
6. (turn_to satellite2 phenomenon14 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon14)
   goals met: 1 of 12
7. (take_image satellite2 phenomenon14 instrument5 spectrograph2)
   added: (have_image phenomenon14 spectrograph2)
   goals met: 2 of 12
8. (turn_to satellite2 phenomenon12 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon12)
   goals met: 2 of 12
9. (turn_to satellite0 groundstation0 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 12
10. (take_image satellite2 phenomenon12 instrument5 spectrograph3)
   added: (have_image phenomenon12 spectrograph3)
   goals met: 3 of 12
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 12
12. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 3 of 12
13. (turn_to satellite0 phenomenon7 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 12
14. (take_image satellite0 phenomenon7 instrument1 spectrograph2)
   added: (have_image phenomenon7 spectrograph2)
   goals met: 4 of 12
15. (turn_to satellite0 phenomenon9 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 12
16. (take_image satellite0 phenomenon9 instrument1 spectrograph2)
   added: (have_image phenomenon9 spectrograph2)
   goals met: 5 of 12
17. (turn_to satellite0 planet16 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet16)
   goals met: 5 of 12
18. (take_image satellite0 planet16 instrument1 thermograph1)
   added: (have_image planet16 thermograph1)
   goals met: 6 of 12
19. (turn_to satellite0 star10 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star10)
   goals met: 6 of 12
20. (take_image satellite0 star10 instrument1 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 7 of 12
21. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 7 of 12
22. (take_image satellite0 star11 instrument1 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 8 of 12
23. (turn_to satellite0 star13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star13)
   goals met: 8 of 12
24. (take_image satellite0 star13 instrument1 spectrograph2)
   added: (have_image star13 spectrograph2)
   goals met: 9 of 12
25. (turn_to satellite0 star6 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star6)
   goals met: 9 of 12
26. (take_image satellite0 star6 instrument1 spectrograph2)
   added: (have_image star6 spectrograph2)
   goals met: 10 of 12
27. (turn_to satellite0 star8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star8)
   goals met: 10 of 12
28. (take_image satellite0 star8 instrument1 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 11 of 12
29. (turn_to satellite1 phenomenon7 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 phenomenon7)
   goals met: 12 of 12
